Охотники_и_рыболовы/src/Documents/РазрешениеНаОхоту/РазрешениеНаОхоту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РазрешениеНаОхоту</name>
  <basedOn>Catalog.Охотники</basedOn>
  <registerRecords>AccumulationRegister.ДобытаяДичь</registerRecords>
  <registerRecords>AccumulationRegister.КвотыОхотхозяйства</registerRecords>
  <registerRecords>AccumulationRegister.ВыдачаРазрешений</registerRecords>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сдан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутевкаДоговор</name>
    <type>
      <types>DocumentRef.ПутевкаДоговор</types>
    </type>
  </attributes>
  <attributes>
    <name>БезПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АктМПР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявление</name>
    <type>
      <types>DocumentRef.Заявление</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДобытаяДичь</name>
    <attributes>
      <name>Дичь</name>
      <type>
        <types>CatalogRef.Дичь</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобычи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Охотники_и_рыболовы/src/AccumulationRegisters/ВыдачаРазрешений/ВыдачаРазрешений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыдачаРазрешений</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОхоты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтчетныйВидДичи</name>
    <type>
      <types>CatalogRef.ОтчетныеВидыДичи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Охотники_и_рыболовы/src/AccumulationRegisters/КвотыОхотхозяйства/КвотыОхотхозяйства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КвотыОхотхозяйства</name>
  <resources>
    <name>КоличествоСвоим</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоЧужим</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Охотники_и_рыболовы/src/AccumulationRegisters/ДобытаяДичь/ДобытаяДичь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДобытаяДичь</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дичь</name>
    <type>
      <types>CatalogRef.Дичь</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Охотники_и_рыболовы/src/Documents/РазрешениеНаОхоту/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ВыдачаРазрешений.Очистить();
	Движения.КвотыОхотхозяйства.Очистить();
	
	
	Движения.ВыдачаРазрешений.Записывать = Истина;
	Движение = Движения.ВыдачаРазрешений.Добавить();
	Движение.Период = Дата;
	Движение.СезонОхоты = СезонОхоты;
	Движение.Охотхозяйство = Охотхозяйство;
	Движение.МестоОхоты = МестоОхоты;
	Движение.ВидДичи = ВидДичи;
	Движение.ОтчетныйВидДичи = ВидДичи.ОтчетныйВидДичи;
	Движение.Сумма = 0.01;
	Движение.Исполнитель = Ответственный;
	Движение.Серия = СерияРазрешения;
	Движение.Номер = НомерРазрешения;
	Движение.ПериодОхоты = "с " + Формат(ДатаНачала,"ДФ = 'дд.ММ.гггг'") + " по " + Формат(ДатаОкончания,"ДФ = 'дд.ММ.гггг'");
	
	
	Движения.КвотыОхотхозяйства.Записывать = Истина;	
	Движения.КвотыОхотхозяйства.БлокироватьДляИзменения = Истина;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&МестоОхоты КАК Охотхозяйство,
		|	ВЫБОР
		|		КОГДА &Охотхозяйство = &МестоОхоты
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоСвоим,
		|	ВЫБОР
		|		КОГДА &Охотхозяйство = &МестоОхоты
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоличествоЧужим,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РазрешениеНаОхотуДобытаяДичь.Ссылка.Охотник,
		|	РазрешениеНаОхотуДобытаяДичь.Ссылка.МестоОхоты,
		|	РазрешениеНаОхотуДобытаяДичь.Дичь,
		|	СУММА(РазрешениеНаОхотуДобытаяДичь.Количество) КАК Количество,
		|	РазрешениеНаОхотуДобытаяДичь.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.РазрешениеНаОхоту.ДобытаяДичь КАК РазрешениеНаОхотуДобытаяДичь
		|ГДЕ
		|	РазрешениеНаОхотуДобытаяДичь.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РазрешениеНаОхотуДобытаяДичь.Дичь,
		|	РазрешениеНаОхотуДобытаяДичь.Ссылка.Охотник,
		|	РазрешениеНаОхотуДобытаяДичь.Ссылка.МестоОхоты,
		|	РазрешениеНаОхотуДобытаяДичь.Ссылка,
		|	РазрешениеНаОхотуДобытаяДичь.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("Охотник", Охотник);
	Запрос.УстановитьПараметр("Охотхозяйство", Охотхозяйство);
	Запрос.УстановитьПараметр("МестоОхоты", МестоОхоты);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Пакет = Запрос.ВыполнитьПакет();
	Выборка = Пакет[0].Выбрать();
	
	Движение = Движения.КвотыОхотхозяйства.Добавить();
	
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движение,Выборка);
		Движение.ВидДичи  = ВидДичи;
		Движение.СезонОхоты = СезонОхоты;
		Движение.Период = Дата;
	КонецЦикла;
	
	Движения.Записать();
	
	//////////////////////////////////////////////
	//Проверим минус
	Выборка.Сбросить();
	Выборка.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &КоличествоСвоим
		|			ТОГДА КвотыОхотхозяйстваОстатки.КоличествоСвоимОстаток
		|		ИНАЧЕ КвотыОхотхозяйстваОстатки.КоличествоЧужимОстаток
		|	КОНЕЦ КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.КвотыОхотхозяйства.Остатки(
		|			&Период,
		|			СезонОхоты = &СезонОхоты
		|				И Охотхозяйство = &Охотхозяйство
		|				И ВидДичи = &ВидДичи) КАК КвотыОхотхозяйстваОстатки";
	
	Запрос.УстановитьПараметр("ВидДичи", ВидДичи);
	Запрос.УстановитьПараметр("Охотхозяйство", МестоОхоты);
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СезонОхоты", СезонОхоты);
	Запрос.УстановитьПараметр("КоличествоСвоим",?(Выборка.КоличествоСвоим > 0,Истина,Ложь));
	Остаток = Запрос.Выполнить().Выбрать();
	
	Пока Остаток.Следующий() Цикл
		Если Остаток.КоличествоОстаток < 0 Тогда
			Отказ = Истина;
			Текст = "Нет квот на добычу " + ВидДичи;
			Поле = "Объект.ВидДичи";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,ЭтотОбъект,Поле,"ЭтотОбъект");
		КонецЕсли;
	КонецЦикла;
	
	Движения.ДобытаяДичь.Записывать = Истина;
	Движения.ДобытаяДичь.Очистить();
	Движения.ДобытаяДичь.Загрузить(Пакет[1].Выгрузить());
	
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Охотники") Тогда
		Охотхозяйство = ДанныеЗаполнения.Охотхозяйство;
		МестоОхоты = ДанныеЗаполнения.Охотхозяйство;
		Охотник = ДанныеЗаполнения.Ссылка;
		СезонОхоты = ОхотаСерверПовтИсп.ПолучитьТекущийСезон();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//Путевка = ОхотаСервер.НайтиПодчиненнуюПутевку(Ссылка);
	//Если НЕ Путевка.Пустая() И Путевка.Проведен Тогда
	//	Отказ = Истина;
	//	Текст = "Нельзя отменять проведение документа.
	//			|Есть подчиненный проведенный документ";
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ТекстЭтотОбъект");
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Путевка = ОхотаСервер.НайтиПодчиненнуюПутевку(Ссылка);
	Если НЕ Путевка.Пустая() Тогда	
		Попытка
			ПутевкаОбъект = Путевка.ПолучитьОбъект();
			ПутевкаОбъект.Удалить();
		Исключение
			Отказ = Истина;
			ТекстОшибки = ОбщегоНазначенияКлиентСервер.СформироватьТекстСообщения(ОписаниеОшибки());
			ЗаписьЖурналаРегистрации("Данные.Удаление",УровеньЖурналаРегистрации.Ошибка,ЭтотОбъект.Метаданные(),ЭтотОбъект.Ссылка,ТекстОшибки);
		КонецПопытки;
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если НЕ БезПроверки Тогда
		ПроверяемыеРеквизиты.Добавить("СезонОхоты");
		ПроверяемыеРеквизиты.Добавить("Охотхозяйство");
		ПроверяемыеРеквизиты.Добавить("МестоОхоты");
		ПроверяемыеРеквизиты.Добавить("ВидДичи");
		ПроверяемыеРеквизиты.Добавить("Охотник");
		ПроверяемыеРеквизиты.Добавить("ДатаНачала");
		ПроверяемыеРеквизиты.Добавить("ДатаОкончания");
		ПроверяемыеРеквизиты.Добавить("СерияРазрешения");
		ПроверяемыеРеквизиты.Добавить("НомерРазрешения");
		ПроверяемыеРеквизиты.Добавить("Ответственный");
	Иначе
		СтруктураДанных = Константы.ОбязательныеРеквизитыРазрешенияДляЕгеря.Получить().Получить();
		Для каждого КлючИЗначение из СтруктураДанных Цикл
			Если КлючИЗначение.Значение Тогда
				ПроверяемыеРеквизиты.Добавить(КлючИЗначение.Ключ);
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
		
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ Ссылка.Пустая() И ПутевкаДоговор.Пустая() Тогда
		ПутевкаДоговор = ОхотаСервер.НайтиПодчиненнуюПутевку(Ссылка);
	КонецЕсли;	
КонецПроцедуры
